{
  "id": "bahaya-lisan-hadis-tirmidzi-ibnu-majah",
  "title": "Bahaya Lisan dan Kunci Surga: Penjelasan Hadis Tirmidzi 2616 & Ibnu Majah 3973",
  "slug": "bahaya-lisan-hadis-tirmidzi-ibnu-majah.html",
  "url": "https://dalam.web.id/artikel/bahaya-lisan-hadis-tirmidzi-ibnu-majah.html",
  "datePublished": "2025-12-06T18:52:49.235+00:00",
  "summary": "Penjelasan santai Hadis Muadz bin Jabal (Tirmidzi 2616 & Ibnu Majah 3973) tentang pokok-pokok kebaikan, tiang utama agama (Salat), dan peringatan keras mengenai bahaya lisan (ucapan). Temukan kunci surga ada di sini!",
  "category": "📚 Sejarah & Religi",
  "promptHint": "Hadis Tirmidzi 2616 dan Ibnu Majah 3973 itu dari sahabat siapa?; Mu'adz bin Jabal bertanya apa kepada Rasulullah?; Apa saja inti pesan Hadis Tirmidzi 2616?; Hadis ini sering disebut sebagai apa?",
  "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiftl8g7HnPEps97jFiWzrFqeHidfKA9GUnsPG1UC56HND4VZTdTXH4k9vcSkyM37jjucr1Osf0tqzyh1Hc-5nKIKcRGqUpzNWHSdmKKP2VwkKT2a7eNQUVFP14TaapuloMy0-i9I0Ps1_522CRGYqz1ySk6CaLpN4ppCtHR-SSlKYX8F9y6Ptr_gZLGCI/s1600/1.webp",
  "content_plain": "Mengurai Hikmah: Hadis Tirmidzi 2616 dan Ibnu Majah 3973 Tentang Kunci Surga, Tiang Agama, dan Bahaya Lisan yang Menjerumuskan Halo Sobat DalamWeb! Kali ini kita akan bahas tuntas sebuah hadis yang sangat luar biasa dan wajib kita renungkan. Hadis ini diriwayatkan oleh Imam At-Tirmidzi (No. 2616) dan Ibnu Majah (No. 3973), yang sumbernya dari sahabat mulia, **Mu'adz bin Jabal** $radhiyallahu$ $anhu$. Hadis ini sering disebut sebagai 'peta jalan' menuju kebaikan sejati. Penasaran kan, apa sih inti dari pesan Rasulullah ﷺ kepada Mu'adz? Bayangkan, Mu'adz bin Jabal bertanya langsung tentang cara pasti masuk Surga dan menjauhi Neraka. Inilah jawabannya! Inti Hadis: Rukun dan Tiang Agama Pertama, Mu'adz bertanya tentang amalan yang pasti memasukkannya ke Surga. Rasulullah ﷺ kemudian menjelaskan secara bertahap, mulai dari pondasi kebaikan: Setelah menyebutkan dasar-dasar Islam, Nabi kemudian menjelaskan urutan prioritas amalan. Beliau bersabda: **\"Maukah aku tunjukkan kepadamu pintu-pintu kebaikan?\"** (Di antaranya) **Puasa adalah perisai**, **sedekah dapat menghapus kesalahan sebagaimana air memadamkan api**, dan **salat seseorang di tengah malam**... Nah, dari sini kita tahu bahwa puasa, sedekah, dan qiyamul lail (salat malam) adalah amalan-amalan super yang bisa melindungi kita dari dosa dan api neraka. Sedekah itu keren, bisa \"memadamkan\" dosa-dosa kita secepat air memadamkan api! Tiang Utama: Salat Adalah Segalanya Kemudian, Rasulullah ﷺ naik ke level yang lebih tinggi, yaitu struktur utama agama. Beliau memberikan perumpamaan yang mudah diingat: \"Maukah aku beritahu engkau tentang **pokok urusan (agama) dan tiangnya**?\" Beliau bersabda: **Pokok urusan (agama) adalah Islam, tiangnya adalah salat, dan puncaknya (tertingginya) adalah jihad di jalan Allah.** Ini adalah penegasan yang sangat kuat. Jika rumah (agama) kita ingin berdiri kokoh, **Salat adalah tiang yang tak boleh roboh**. Tanpa salat, seluruh bangunan keimanan kita berpotensi ambruk. Puncak tertinggi amalan? **Jihad**, yang dimaknai luas sebagai usaha maksimal di jalan Allah, termasuk berjuang melawan hawa nafsu. Jaga lisanmu, sebelum lisanmu menjerumuskanmu. Pesan kunci dari hadis ini. Peringatan Keras: Bahaya Lidah! Inilah bagian yang paling mengejutkan dari hadis ini, dan seringkali menjadi klimaks yang mengubah hidup. Setelah menjelaskan semua amalan baik, Rasulullah $shallallahu$ 'alaihi $wa$ $sallam$ kemudian berkata, \"Maukah aku beritahu engkau tentang **inti dari semua perkara itu**?\" Lalu, beliau tidak menunjuk ke hati, tidak ke tangan, tapi ke **LIDAH** beliau sendiri seraya bersabda: **\"Jagalah ini (lisan)!\"** Mu'adz, yang kaget, bertanya, \"Ya Nabi Allah, apakah kita akan disiksa karena perkataan yang kita ucapkan?\" Dan inilah jawaban yang menusuk, yang harus kita catat baik-baik: **\"Celakalah ibumu (wahai Mu'adz)! Bukankah manusia itu dijungkirkan ke dalam Neraka di atas wajah-wajah mereka—atau di atas hidung-hidung mereka—melainkan karena hasil dari ucapan lisan-lisan mereka?\"** Setiap perkataan harus dipertanggungjawabkan. Hati-hati dengan jempol dan lisan kita! Kesimpulan dan Pelajaran Hidup Apa sih makna mendalam dari hadis Mu'adz bin Jabal ini buat kita di era digital? Prioritas Utama: Jangan pernah sepelekan **Salat**! Itu adalah tiang agama. Kalau tiangnya kuat, insya Allah amalan lain ikut kuat. Sedekah Itu Hebat: Ingin dosa-dosa terhapus cepat? Perbanyak sedekah! Ia seperti pemadam api yang efektif. Lisan Adalah Penentu: Semua kebaikan yang kita lakukan (Salat, Puasa, Sedekah) bisa lenyap atau sia-sia hanya karena kita tidak menjaga lisan. **Ghibah (gosip), fitnah, ujaran kebencian, atau dusta** adalah 'ranjau' yang paling sering menjerumuskan manusia ke Neraka. Kontekstual di Era Digital: Di zaman sekarang, lisan tidak hanya berarti mulut. Ia meluas menjadi **jempol** kita di media sosial. Satu ketikan buruk, satu komentar pedas, atau satu postingan yang menyebar fitnah, itu semua adalah 'hasil ucapan lisan' kita yang bisa menjungkirkan kita di akhirat. Semoga kita semua diberikan kemampuan untuk menjaga lisan (dan jempol) kita dari hal-hal yang tidak bermanfaat, apalagi yang menjerumuskan. Mari fokus pada amalan yang menjadi tiang agama dan kunci surga! Kolom Komentar"
}